class Messages:
    GAME_START = """🎲 درحال جستجوی بازیکن برای شروع...
🔸 نوع بازی: سخت ، ۸ نفره
🎭 ترکیب بازی 👈 /help_roles_hard

👥 لیست افراد در صف انتظار
{}"""

    PLAYER_JOINED = "‏{}. ‏👑 {} به این بازی پیوست."
    
    ROLE_ASSIGN = """🗣 بازی شروع شد، ۲۵ ثانیه وقت داری به بقیه سلام کنی

نقش شما: {}
گروه: {}
توضیحات: {}

🎭 ترکیب بازی 👈 /help_roles_hard

💬 چت: فعال
🌙 شب اول 👈 ⏱ 25 ثانیه"""

    NIGHT_START = """🌙 #شب {}
🎭 نقش شما: {} {}
🏳️ گروه: {}
{}
💬 چت: {}
🌞 روز 👈 ⏱ 40 ثانیه"""

    DAY_START = """🌞 #روز {}

{}

{}

💬 چت کردن  👈 ⏱ 5 ثانیه"""

    VOTE_START = """‏#رای بدهید و افراد مشکوک را اعدام کنید.
حداقل ۳ رای لازم است....
⚖️ پایان رای گیری  👈 ⏱ 45 ثانیه"""

    DEFENSE_TIME = """‏{} به دادگاه فراخوانده شد.
متهم 15 ثانیه فرصت دارد از خود دفاع کند

💬 چت: فقط برای متهم"""

    FINAL_VOTE = """تصمیم نهایی خود را بگیرید و رای بدهید
متهم: {}

⚖️ پایان رای گیری  👈 ⏱ 15 ثانیه"""

    EXECUTION_RESULT = """{}

{} اعدام شد
نقش: {} {}
💬 چت: فعال
🌙 شب 👈 ⏱ ۱۵ ثانیه"""